In [26]:
# Importando pacotes
import pandas as pd

In [27]:
# Criando Data Frame
data1 = {'NOME':['LINCOLN','THIAGO','NEVES']}
data2 = pd.DataFrame(data1)
data2

      NOME
0  LINCOLN
1   THIAGO
2    NEVES

In [28]:
# Realizando o 'substring' com 'str.slice', para as duas primeiras letras
data2['NOME2'] = data2['NOME'].str.slice(start=0, stop=2)
data2

      NOME NOME2
0  LINCOLN    LI
1   THIAGO    TH
2    NEVES    NE

In [32]:
# Realizando o 'substring' com 'str.slice', para remover as duas últimas letras
data2['NOME3'] = data2['NOME'].str.slice(stop=-2)
data2

      NOME NOME2  NOME3
0  LINCOLN    LI  LINCO
1   THIAGO    TH   THIA
2    NEVES    NE    NEV

In [33]:
# Realizando o 'substring' com 'str.slice', para deixar as duas últimas letras
data2['NOME4'] = data2['NOME'].str.slice(start=-2)
data2

      NOME NOME2  NOME3 NOME4
0  LINCOLN    LI  LINCO    LN
1   THIAGO    TH   THIA    GO
2    NEVES    NE    NEV    ES

In [37]:
# Realizando o 'substring' com 'str.slice', para deixar letras do meio dos nomes
data2['NOME5'] = data2['NOME'].str.slice(start=2,stop=4)
data2

      NOME NOME2  NOME3 NOME4 NOME5
0  LINCOLN    LI  LINCO    LN    CO
1   THIAGO    TH   THIA    GO    AG
2    NEVES    NE    NEV    ES    ES